{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "W_regularizer": null, "bias": true, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "nb_row": 3, "nb_filter": 16, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "input_dtype": "float32", "nb_col": 3, "W_constraint": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "W_regularizer": null, "bias": true, "nb_filter": 32, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "nb_col": 3, "W_constraint": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "W_regularizer": null, "bias": true, "nb_filter": 64, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "nb_col": 3, "W_constraint": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "W_regularizer": null, "bias": true, "nb_filter": 128, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "nb_col": 3, "W_constraint": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "hidden1", "W_regularizer": null, "bias": true, "input_dim": 18432, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "output_dim": 128}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "output", "W_regularizer": null, "bias": true, "input_dim": 128, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "output_dim": 1}}]}