{"config": [{"config": {"b_regularizer": null, "activation": "linear", "nb_filter": 8, "activity_regularizer": null, "batch_input_shape": [null, 50, 160, 3], "dim_ordering": "tf", "trainable": true, "b_constraint": null, "nb_col": 7, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "input_dtype": "float32", "name": "convolution2d_1", "nb_row": 7, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "activation": "linear", "nb_filter": 16, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_2", "nb_row": 3, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "activation": "linear", "nb_filter": 32, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_3", "nb_row": 3, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "activation": "linear", "input_dim": 2176, "activity_regularizer": null, "trainable": true, "b_constraint": null, "output_dim": 64, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "hidden1", "bias": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "input_dim": 64, "activity_regularizer": null, "trainable": true, "b_constraint": null, "output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "output", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}